; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v8 ?v7)
		(pred_1 ?v2)
		(pred_4 ?v6)
		(pred_3 ?v6)
		(pred_6 ?v2 ?v6)
		(pred_5)
		(pred_2 ?v2))

   (:action op_3
       :parameters  (?v3 ?v4)
       :precondition (and (not-eq ?v3 ?v4) 
                          (pred_4 ?v3) (pred_4 ?v4) (pred_3 ?v3))
       :effect (and  (pred_3 ?v4)
		     (not (pred_3 ?v3))))


   (:action op_1
       :parameters (?v1 ?v5)
       :precondition  (and  (pred_1 ?v1) (pred_4 ?v5)
			    (pred_6 ?v1 ?v5) (pred_3 ?v5) (pred_5))
       :effect (and (pred_2 ?v1)
		    (not (pred_6 ?v1 ?v5)) 
		    (not (pred_5))))

   (:action op_2
       :parameters  (?v1  ?v5)
       :precondition  (and  (pred_1 ?v1) (pred_4 ?v5)
			    (pred_2 ?v1) (pred_3 ?v5))
       :effect (and (pred_6 ?v1 ?v5)
		    (pred_5)
		    (not (pred_2 ?v1)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_09 obj_04 obj_07 obj_01 obj_06 obj_02 
          obj_05 obj_08 obj_03 
)
(:init
(pred_4 obj_09)
(pred_4 obj_04)
(pred_4 obj_07)
(pred_4 obj_01)
(pred_4 obj_06)
(pred_4 obj_02)
(pred_1 obj_05)
(pred_1 obj_08)
(pred_1 obj_03)
(not-eq obj_09 obj_04)
(not-eq obj_04 obj_09)
(not-eq obj_09 obj_07)
(not-eq obj_07 obj_09)
(not-eq obj_09 obj_01)
(not-eq obj_01 obj_09)
(not-eq obj_09 obj_06)
(not-eq obj_06 obj_09)
(not-eq obj_09 obj_02)
(not-eq obj_02 obj_09)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(pred_5)
(pred_6 obj_05 obj_01)
(pred_6 obj_08 obj_07)
(pred_6 obj_03 obj_07)
(pred_3 obj_06)
)
(:goal
(and
(pred_6 obj_05 obj_01)
(pred_6 obj_08 obj_09)
(pred_6 obj_03 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_08 obj_09) (pred_3 obj_04))
    (sometime-before  (pred_6 obj_03 obj_04) (pred_3 obj_09))
  )
)
)

; plan
1. (op_3 obj_06 obj_07)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_07)
   goals met: 1 of 3
2. (op_1 obj_03 obj_07)
   deleted: (pred_6 obj_03 obj_07) (pred_5)
   added: (pred_2 obj_03)
   goals met: 1 of 3
3. (op_3 obj_07 obj_04)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_04)
   goals met: 1 of 3
4. (op_3 obj_04 obj_09)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_09)
   goals met: 1 of 3
5. (op_2 obj_03 obj_09)
   deleted: (pred_2 obj_03)
   added: (pred_6 obj_03 obj_09) (pred_5)
   goals met: 1 of 3
6. (op_3 obj_09 obj_07)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_07)
   goals met: 1 of 3
7. (op_1 obj_08 obj_07)
   deleted: (pred_6 obj_08 obj_07) (pred_5)
   added: (pred_2 obj_08)
   goals met: 1 of 3
8. (op_3 obj_07 obj_09)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_09)
   goals met: 1 of 3
9. (op_2 obj_08 obj_09)
   deleted: (pred_2 obj_08)
   added: (pred_6 obj_08 obj_09) (pred_5)
   goals met: 2 of 3
10. (op_1 obj_03 obj_09)
   deleted: (pred_6 obj_03 obj_09) (pred_5)
   added: (pred_2 obj_03)
   goals met: 2 of 3
11. (op_3 obj_09 obj_04)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_04)
   goals met: 2 of 3
12. (op_2 obj_03 obj_04)
   deleted: (pred_2 obj_03)
   added: (pred_6 obj_03 obj_04) (pred_5)
   goals met: 3 of 3
